blog/2020-04-27/Rust-Traits-Iterator.org
# -*- find-file-hook: make-blogging-mode -*-
#+AUTHOR: David Briggs
#+TITLE: Rust Traits: Iterator
#+OPTIONS: html-style:nil num:nil
<2020-04-27 Mon>
#+ATTR_HTML: target="_blank"

* Rust Traits: Iterator
  
The [[https://doc.rust-lang.org/std/iter/trait.Iterator.html][Iterator]] trait in Rust allows you to conveniently operate over a sequence of elements.
They provide an expressive, functional, convenient, and performant way to do computations.

This article will focus on the mechanics of the trait and offer a deeper look into it.
If you're not already familiar with traits in Rust, I recommend skimming the [[https://doc.rust-lang.org/book/ch10-02-traits.html][rust book chapter]] before reading this article.

** The Basics

Iterators are very common in Rust, and if you've written Rust you have likely used them.
Here is a basic example:

#+begin_src rust
  for val in 0..10 {
    // ... use val
  }
#+end_src

=0..10= is a =Range=, which implements =Iterator=, which is central to the function of for-loops ([[https://doc.rust-lang.org/nightly/std/iter/#for-loops-and-intoiterator][desugar here]]).

You may have written something more complex as well:

#+begin_src rust
  let v1 = vec![1, 2, 3];
  let v2 = vec![4, 5, 6];

  let dot_product: u32 = v1
      .iter()
      .zip(v2)
      .map(|(l, r)| l * r)
      .sum(); // 32
#+end_src


Either way, we're iterating and operating on some sequence of values. The =Iterator= trait provides
convenient ways to construct, transform, and consume these sequences.

** The Iterator Trait
   

The =Iterator= trait could be thought as having three parts:

1. The foundation: a =next()= function which returns some type =Item= if it can.
2. Lots and lots of methods for iterator transformations (e.g. functional tools like =map= and =filter=).
3. A function called =collect()=, which allows you to evaluate iterators into some collection type.
   
   
*** The Foundation
    
The foundation to the =Iterator= is a type =Item=, and a method =next()= which returns =Option<Item>=:

#+begin_src rust
  trait Iterator {
    type Item;
    fn next(&mut self) -> Option<Self::Item>;
    // ... several elided methods
  }
#+end_src

Annotated with comments:

#+begin_src rust
  trait Iterator {
    type Item;
    //   ^-- Associated type; the type we are returning each iteration
    fn next(&mut self) -> Option<Self::Item>;
    // ^    ^             ^ returns either an Item, or nothing
    // |    | it mutates something each iteration
    // | `next` method gets somehow called each iteration in for-loops

    // ... several elided methods
  }
#+end_src

The trait signature tells us a lot about how it works:

1. We need to mutate the type for which we implement Iterator (something needs to book-keep).
2. If we have a value to yield, return =Some(val)=
   1. Otherwise, stop iteration by yielding =None=
3. We return the same type each iteration.

So now that we've seen the foundation, let's preview some =Iterator= trait methods for transforming iterators.

