blog/2020-04-27/Rust-Traits-Iterator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-12 Tue 14:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rust Traits: Iterator</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Briggs" />
</head>
<body>
<div id="content">
<h1 class="title">Rust Traits: Iterator</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee7b554">Rust Traits: Iterator</a>
<ul>
<li><a href="#orgb007c76">The Basics</a></li>
<li><a href="#orgefbc3bd">The Iterator Trait</a>
<ul>
<li><a href="#org71f8bfe">The Foundation</a></li>
<li><a href="#org9e867b0">The Thousand Elided Methods</a></li>
<li><a href="#org46ae7c7">The collect() Method</a></li>
</ul>
</li>
<li><a href="#orgdd791f4">Part 1: The Natural Numbers</a>
<ul>
<li><a href="#org27a8f9a">Implementing Map</a></li>
<li><a href="#orgbf58474">Filter</a></li>
<li><a href="#orgbc03213">Reduce</a></li>
<li><a href="#orgb222ccc">Quick note on reduce</a></li>
</ul>
</li>
<li><a href="#org44f7662">Part 2: Our own Iterator Trait</a></li>
<li><a href="#org3b0c2ad">Conclusion</a></li>
<li><a href="#org9712279">Appendix: The Primes</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2020-04-27 Mon&gt;</span></span>
</p>

<div id="outline-container-orgee7b554" class="outline-2">
<h2 id="orgee7b554">Rust Traits: Iterator</h2>
<div class="outline-text-2" id="text-orgee7b554">
<p>
The <a href="https://doc.rust-lang.org/std/iter/trait.Iterator.html">Iterator</a> trait in Rust allows you to conveniently operate over a sequence of elements.
They provide an expressive, functional, convenient, and performant way to do computations.
</p>

<p>
This article will focus on the mechanics of the trait and offer a deeper look into it.
If you're not already familiar with traits in Rust, I recommend skimming the <a href="https://doc.rust-lang.org/book/ch10-02-traits.html">rust book chapter</a> before reading this article.
</p>
</div>

<div id="outline-container-orgb007c76" class="outline-3">
<h3 id="orgb007c76">The Basics</h3>
<div class="outline-text-3" id="text-orgb007c76">
<p>
Iterators are very common in Rust, and if you've written Rust you have likely used them.
Here is a basic example:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">val</span> <span style="color: #FDECBC; font-weight: bold;">in</span> <span style="color: #CCF8CC;">0</span>..<span style="color: #CCF8CC;">10</span> <span style="color: #DCDCCC;">{</span>
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">... use val</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
<code>0..10</code> is a <code>Range</code>, which implements <code>Iterator</code>, which is central to the function of for-loops.
</p>

<p>
You may have written something more complex as well:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">v1</span> = <span style="color: #9CC7FB;">vec!</span><span style="color: #DCDCCC;">[</span><span style="color: #CCF8CC;">1</span>, <span style="color: #CCF8CC;">2</span>, <span style="color: #CCF8CC;">3</span><span style="color: #DCDCCC;">]</span>;
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">v2</span> = <span style="color: #9CC7FB;">vec!</span><span style="color: #DCDCCC;">[</span><span style="color: #CCF8CC;">4</span>, <span style="color: #CCF8CC;">5</span>, <span style="color: #CCF8CC;">6</span><span style="color: #DCDCCC;">]</span>;

<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">dot_product</span>: <span style="color: #89C5C8;">u32</span> = v1
    .iter<span style="color: #DCDCCC;">()</span>
    .zip<span style="color: #DCDCCC;">(</span>v2<span style="color: #DCDCCC;">)</span>
    .map<span style="color: #DCDCCC;">(</span>|<span style="color: #CCF8CC;">(</span>l, r<span style="color: #CCF8CC;">)</span>| l * r<span style="color: #DCDCCC;">)</span>
    .sum<span style="color: #DCDCCC;">()</span>; <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">32</span>
</pre>
</div>


<p>
Either way, we're iterating and operating on some sequence of values. The <code>Iterator</code> trait provides
convenient ways to construct, transform, and consume these sequences.
</p>
</div>
</div>

<div id="outline-container-orgefbc3bd" class="outline-3">
<h3 id="orgefbc3bd">The Iterator Trait</h3>
<div class="outline-text-3" id="text-orgefbc3bd">
<p>
The <code>Iterator</code> trait could be thought as having three parts:
</p>

<ol class="org-ol">
<li>The foundation: a <code>next()</code> function which returns some type <code>Item</code> if it can.</li>
<li>Lots and lots of methods for iterator transformations (e.g. functional tools like <code>map</code> and <code>filter</code>).</li>
<li>A function called <code>collect()</code>, which allows you to evaluate iterators into some collection type.</li>
</ol>
</div>


<div id="outline-container-org71f8bfe" class="outline-4">
<h4 id="org71f8bfe">The Foundation</h4>
<div class="outline-text-4" id="text-org71f8bfe">
<p>
The foundation to the <code>Iterator</code> is a type <code>Item</code>, and a method <code>next()</code> which returns <code>Option&lt;Item&gt;</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">trait</span> <span style="color: #89C5C8;">Iterator</span> <span style="color: #DCDCCC;">{</span>
  <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span>;
  <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">next</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">&gt;</span>;
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">... several elided methods</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Annotated with comments:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">trait</span> <span style="color: #89C5C8;">Iterator</span> <span style="color: #DCDCCC;">{</span>
  <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span>;
  <span style="color: #6C8C6C;">//   </span><span style="color: #8CAC8C;">^-- Associated type; the type we are returning each iteration</span>
  <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">next</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">&gt;</span>;
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">^    ^             ^ returns either an Item, or nothing</span>
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">|    | it mutates something each iteration</span>
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">| `next` method gets somehow called each iteration in for-loops</span>

  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">... several elided methods</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
The trait signature tells us a lot about how it works:
</p>

<ol class="org-ol">
<li>We need to mutate the type for which we implement Iterator (something needs to book-keep).</li>
<li>If we have a value to yield, return <code>Some(val)</code>
<ol class="org-ol">
<li>Otherwise, stop iteration by yielding <code>None</code></li>
</ol></li>
<li>We return the same type each iteration.</li>
</ol>

<p>
So now that we've seen the foundation, let's preview some <code>Iterator</code> trait methods for transforming iterators.
</p>
</div>
</div>
