blog/2020-04-27/Rust-Traits-Iterator.org
*** The Thousand Elided Methods
    
While it's nice that we can cleanly define a way to retrieve a single element at a time from a collection,
it would be very nice to operate on the iterable itself. The =Iterator= trait provides a LOT of functions
to conveniently work with iterators in a functional style. We can succinctly express more complex logic with
these methods -- for example:

#+begin_src rust
  let some_iterable = 0..100;
  let sum = some_iterable
      .filter(|&e| e > 50)
      .map(|e| e * e)
      .sum();
#+end_src

vs

#+begin_src rust
  let some_iterable = 0..100;
  let mut sum = 0;
  for e in some_iterable {
      if !(e > 50) {
          continue;
      }
      let doubled = e * e;
      sum += doubled;
  }
#+end_src

I personally find the first far easier to read as it requires much less parsing. This isn't always true of iterators in Rust,
but most of the time it is.

Other methods we'll use for this article include =Iterator::take(N)=, which only takes up-to N elements from the iterator.
This is useful for infinite iterators, and is common in functional languages.

You can view a list of the iterator methods [[https://doc.rust-lang.org/std/iter/trait.Iterator.html#provided-methods][here]].

*** The collect() Method
    
While important, this article won't focus much on the mechanics of =collect()=. In short, [[https://doc.rust-lang.org/std/iter/trait.Iterator.html#method.collect][this method]] uses the [[https://doc.rust-lang.org/std/iter/trait.FromIterator.html][FromIterator]] trait
to convert iterators into some collection. You'll find yourself using this often when working with iterators to convert
them into tangible and convenient types.

There's a good example of =collect()= [[https://doc.rust-lang.org/std/iter/trait.Iterator.html#examples-25][here]].

Now that we've seen an overview of what's provided, we can implement Iterator!

** Part 1: The Natural Numbers

To get more familiar with the trait, let's make a useful construct: The Natural Numbers.

To implement this, we'll need a struct holding the current value:

#+begin_src rust
  // Book keeping struct
  struct NaturalNumbers {
      curr: u32,
  }

  // Start at 0 because computers
  impl NaturalNumbers {
      fn new() -> Self {
          Self { curr: 0 }
      }
  }
#+end_src

And implement Iterator by incrementing =curr=:

#+begin_src rust
  impl Iterator for NaturalNumbers {
      type Item = u32;
    
      fn next(&mut self) -> Option<Self::Item> {
          let ret = self.curr;
          self.curr += 1;
          Some(ret)
      }
  }
#+end_src

Nice! We have a struct =NaturalNumbers= which will yield every natural number until it panics on overflow.

This is certainly useful, and will serve as a bedrock for later functions. Unfortunately our terminals don't appreciate
printing millions of integers, so we'll use the method =Iterator::take(N)= which limits the number of iterations to at most =N=.

We can then test =NaturalNumbers= with:

#+begin_src rust
fn main() {
    for i in NaturalNumbers::new().take(5) {
        println!("{}", i);
    }
}
#+end_src

Which outputs:

#+begin_src bash
~ cargo run
   Compiling iterator-article v0.1.0 (/home/david/programming/iterator-article)
    Finished dev [unoptimized + debuginfo] target(s) in 0.15s
     Running `target/debug/iterator-article`
0
1
2
3
4
#+end_src

You can the run this example yourself on the [[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=2788c80f1014d5ac19fa345d97dcd408][Rust playground]]!

So now that we can generate a sequence of values, let's implement some familiar functional friends: =map=, =filter=, and =reduce= (=fold=).

