blog/2020-04-27/Rust-Traits-Iterator.html

<div id="outline-container-org9e867b0" class="outline-4">
<h4 id="org9e867b0">The Thousand Elided Methods</h4>
<div class="outline-text-4" id="text-org9e867b0">
<p>
While it's nice that we can cleanly define a way to retrieve a single element at a time from a collection,
it would be very nice to operate on the iterable itself. The <code>Iterator</code> trait provides a LOT of functions
to conveniently work with iterators in a functional style. We can succinctly express more complex logic with
these methods &#x2013; for example:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">some_iterable</span> = <span style="color: #CCF8CC;">0</span>..<span style="color: #CCF8CC;">100</span>;
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">sum</span> = some_iterable
    .filter<span style="color: #DCDCCC;">(</span>|&amp;e| e &gt; <span style="color: #CCF8CC;">50</span><span style="color: #DCDCCC;">)</span>
    .map<span style="color: #DCDCCC;">(</span>|e| e * e<span style="color: #DCDCCC;">)</span>
    .sum<span style="color: #DCDCCC;">()</span>;
</pre>
</div>

<p>
vs
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">some_iterable</span> = <span style="color: #CCF8CC;">0</span>..<span style="color: #CCF8CC;">100</span>;
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">sum</span> = <span style="color: #CCF8CC;">0</span>;
<span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">e</span> <span style="color: #FDECBC; font-weight: bold;">in</span> some_iterable <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">if</span> e &gt; <span style="color: #CCF8CC;">50</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">continue</span>;
    <span style="color: #CCF8CC;">}</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">doubled</span> = e * e;
    sum += doubled;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
I personally find the first far easier to read as it requires much less parsing. This isn't always true of iterators in Rust,
but most of the time it is.
</p>

<p>
Other methods we'll use for this article include <code>Iterator::take(N)</code>, which only takes up-to N elements from the iterator.
This is useful for infinite iterators, and is common in functional languages.
</p>

<p>
You can view a list of the iterator methods <a href="https://doc.rust-lang.org/std/iter/trait.Iterator.html#provided-methods">here</a>.
</p>
</div>
</div>

<div id="outline-container-org46ae7c7" class="outline-4">
<h4 id="org46ae7c7">The collect() Method</h4>
<div class="outline-text-4" id="text-org46ae7c7">
<p>
While important, this article won't focus much on the mechanics of <code>collect()</code>. In short, <a href="https://doc.rust-lang.org/std/iter/trait.Iterator.html#method.collect">this method</a> uses the <a href="https://doc.rust-lang.org/std/iter/trait.FromIterator.html">FromIterator</a> trait
to convert iterators into some collection. You'll find yourself using this often when working with iterators to convert
them into tangible and convenient types.
</p>

<p>
There's a good example of <code>collect()</code> <a href="https://doc.rust-lang.org/std/iter/trait.Iterator.html#examples-25">here</a>.
</p>

<p>
Now that we've seen an overview of what's provided, we can implement Iterator!
</p>
</div>
</div>
</div>

<div id="outline-container-orgdd791f4" class="outline-3">
<h3 id="orgdd791f4">Part 1: The Natural Numbers</h3>
<div class="outline-text-3" id="text-orgdd791f4">
<p>
To get more familiar with the trait, let's make a useful construct: The Natural Numbers.
</p>

<p>
To implement this, we'll need a struct holding the current value:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Book keeping struct</span>
<span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">NaturalNumbers</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ECBC9C;">curr</span>: <span style="color: #89C5C8;">u32</span>,
<span style="color: #DCDCCC;">}</span>

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Start at 0 because computers</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">NaturalNumbers</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">new</span><span style="color: #CCF8CC;">()</span> -&gt; <span style="color: #89C5C8;">Self</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Self</span> <span style="color: #DDCC9C;">{</span> <span style="color: #ECBC9C;">curr</span>: <span style="color: #CCF8CC;">0</span> <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And implement Iterator by incrementing <code>curr</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Iterator</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">NaturalNumbers</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span> = <span style="color: #89C5C8;">u32</span>;

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">next</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">ret</span> = <span style="color: #FDECBC; font-weight: bold;">self</span>.curr;
        <span style="color: #FDECBC; font-weight: bold;">self</span>.curr += <span style="color: #CCF8CC;">1</span>;
        <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span>ret<span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Nice! We have a struct <code>NaturalNumbers</code> which will yield every natural number until it panics on overflow.
</p>

<p>
This is certainly useful, and will serve as a bedrock for later functions. Unfortunately our terminals don't appreciate
printing millions of integers, so we'll use the method <code>Iterator::take(N)</code> which limits the number of iterations to at most <code>N</code>.
</p>

<p>
We can then test <code>NaturalNumbers</code> with:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">i</span> <span style="color: #FDECBC; font-weight: bold;">in</span> <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>.take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">5</span><span style="color: #CCF8CC;">)</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #DDCC9C;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, i<span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Which outputs:
</p>

<div class="org-src-container">
<pre class="src src-bash">~ cargo run
   Compiling iterator-article v0.1.0 <span style="color: #DCDCCC;">(</span>/home/david/programming/iterator-article<span style="color: #DCDCCC;">)</span>
    Finished dev <span style="color: #DCDCCC;">[</span>unoptimized + debuginfo<span style="color: #DCDCCC;">]</span> target<span style="color: #DCDCCC;">(</span>s<span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">in</span> <span style="color: #CCF8CC;">0.15s</span>
     Running <span style="color: #D9A0A0;">`target/debug/iterator-article`</span>
<span style="color: #CCF8CC;">0</span>
<span style="color: #CCF8CC;">1</span>
<span style="color: #CCF8CC;">2</span>
<span style="color: #CCF8CC;">3</span>
<span style="color: #CCF8CC;">4</span>
</pre>
</div>

<p>
You can the run this example yourself on the <a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=2788c80f1014d5ac19fa345d97dcd408">Rust playground</a>!
</p>

<p>
So now that we can generate a sequence of values, let's implement some familiar functional friends: <code>map</code>, <code>filter</code>, and <code>reduce</code> (<code>fold</code>).
</p>
</div>
