blog/2020-04-27/Rust-Traits-Iterator.org
*** Implementing Map
   
A frequent programming task is to loop over some collection and operate (transform) the type of an element given in each iteration.

This occurs commonly when retrieving data from some source, and you need to bind the data in some useful construct (class / struct / etc).
Or if you're crunching numbers you may want to operate on each element individually before some other step.

Either way, this pattern is so common that most languages offer the =map= construct -- a way to provide an iterable and a function, and get
the function applied to each element of the iterable returned.

For example, let's double each number in a vector. Rust offers a =map()= method on iterators, so we'll use that first:

Pseudo-code:

#+begin_example
seq: 0, 1, 2, 3, ...
fn:  |e| e * e
out: 0, 1, 4, 9, ...
#+end_example

Rust:

#+begin_src rust

  let input = vec![1, 2, 3];
  let doubled: Vec<_> = input
      .iter()
      .map(|e| e * e)
      .collect();

#+end_src

So we provide a function, =|e| e * e= which double numbers, and =map= implicitly takes =self=, which is an iterator.
This may not make sense right now, so let's dig deeper into building our own =Map=.

Things are going to get a little higher-order here, so let's outline what we'll need:

1. We need a type =Iter=, which implements =Iterator=
2. We need a function, which maps =Iter::Item= to some output type =Out=
   1. Syntax: =Iter::Item= is the associated type =Item= from implementation of =Iterator= on =Iter=.
   2. We can express the map function in Rust then as =FnMut(Iter::Item) -> Out=
      1. FnMut as we're consuming the element and may want to mutate captured variables. Feel free to use =Fn= if you don't want that. More on this later in the Reduce section.

Putting the above together we'll need a struct to store our function and iterator:

#+begin_src rust
   // Our Map struct
  struct Map<Iter, Fn> {
      iter: Iter,
      f: Fn,
  }

  // We'll want to instantiate one later, so add a constructor method:
  impl<Iter, Fn> Map<Iter, Fn> {
      fn new(iter: Iter, f: Fn) -> Self {
          Self { iter, f }
      }
  }
#+end_src


Great, we can now tackle implementing Iterator. The first challenge is getting the types setup
for our impl. As described above, we'll need an =Iter=, =F= (map fn), and =Out= types:

#+begin_src rust
impl<Iter, F, Out> Iterator ...
#+end_src

But we need further guarantees as described above:

#+begin_src rust
impl<Iter: Iterator, F: FnMut(Iter::Item) -> Out, Out> Iterator ...
#+end_src

I recommend the reader really make sure the type signature above makes sense. Rust has a tendency to hit type soup,
and it is worthwhile to take a minute to understand it.

We can now implement =Iterator= in a straightforward way:

#+begin_src rust
  impl<Iter: Iterator, F: FnMut(Iter::Item) -> Out, Out> Iterator for Map<Iter, F> {
      type Item = Out;
    
      fn next(&mut self) -> Option<Self::Item> {
          self.iter.next().map(|e| (self.f)(e))
      }
  }
#+end_src

So we're calling =next()= on our stored iterator to iterate once, and mapping the value with our stored function,
and returning it. This is very efficient and something that rustc / llvm love to optimize, which gives some insight
into why Rust iterators are so fast.

Now that we have it, let's use it!

#+begin_src rust
fn main() {
    let nat = NaturalNumbers::new().take(5);
    let seq = Map::new(nat, |e| e * e);
    for i in seq {
        println!("{}", i);
    }
}
#+end_src

And run it:

#+begin_src bash
$ cargo run
     Compiling iterator-article v0.1.0 (/home/david/programming/iterator-article)
      Finished dev [unoptimized + debuginfo] target(s) in 0.17s
       Running `target/debug/iterator-article`
  0
  1
  4
  9
  16
#+end_src

Nice! We can transform sequences using our own struct. If you want to see it in action yourself, you can play with it on the [[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=b28ba9529299e04dd3f0c67b053505eb][rust playground]].

This is certainly powerful, but it would be nice to filter the element as well. =Map= only has access to a single element at a time, and must
operate on the element. We can play around with the function types passed but most of the time we just want to filter out certain elements.

