blog/2020-04-27/Rust-Traits-Iterator.html

<div id="outline-container-org27a8f9a" class="outline-4">
<h4 id="org27a8f9a">Implementing Map</h4>
<div class="outline-text-4" id="text-org27a8f9a">
<p>
A frequent programming task is to loop over some collection and operate (transform) the type of an element given in each iteration.
</p>

<p>
This occurs commonly when retrieving data from some source, and you need to bind the data in some useful construct (class / struct / etc).
Or if you're crunching numbers you may want to operate on each element individually before some other step.
</p>

<p>
Either way, this pattern is so common that most languages offer the <code>map</code> construct &#x2013; a way to provide an iterable and a function, and get
the function applied to each element of the iterable returned.
</p>

<p>
For example, let's double each number in a vector. Rust offers a <code>map()</code> method on iterators, so we'll use that first:
</p>

<p>
Pseudo-code:
</p>

<pre class="example">
seq: 0, 1, 2, 3, ...
fn:  |e| e * e
out: 0, 1, 4, 9, ...
</pre>

<p>
Rust:
</p>

<div class="org-src-container">
<pre class="src src-rust">
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">input</span> = <span style="color: #9CC7FB;">vec!</span><span style="color: #DCDCCC;">[</span><span style="color: #CCF8CC;">1</span>, <span style="color: #CCF8CC;">2</span>, <span style="color: #CCF8CC;">3</span><span style="color: #DCDCCC;">]</span>;
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">doubled</span>: <span style="color: #89C5C8;">Vec</span><span style="color: #DCDCCC;">&lt;</span>_<span style="color: #DCDCCC;">&gt;</span> = input
    .iter<span style="color: #DCDCCC;">()</span>
    .map<span style="color: #DCDCCC;">(</span>|e| e * e<span style="color: #DCDCCC;">)</span>
    .collect<span style="color: #DCDCCC;">()</span>;

</pre>
</div>

<p>
So we provide a function, <code>|e| e * e</code> which double numbers, and <code>map</code> implicitly takes <code>self</code>, which is an iterator.
This may not make sense right now, so let's dig deeper into building our own <code>Map</code>.
</p>

<p>
Things are going to get a little higher-order here, so let's outline what we'll need:
</p>

<ol class="org-ol">
<li>We need a type <code>Iter</code>, which implements <code>Iterator</code></li>
<li>We need a function, which maps <code>Iter::Item</code> to some output type <code>Out</code>
<ol class="org-ol">
<li>Syntax: <code>Iter::Item</code> is the associated type <code>Item</code> from implementation of <code>Iterator</code> on <code>Iter</code>.</li>
<li>We can express the map function in Rust then as <code>FnMut(Iter::Item) -&gt; Out</code>
<ol class="org-ol">
<li>FnMut as we're consuming the element and may want to mutate captured variables. Feel free to use <code>Fn</code> if you don't want that. More on this later in the Reduce section.</li>
</ol></li>
</ol></li>
</ol>

<p>
Putting the above together we'll need a struct to store our function and iterator:
</p>

<div class="org-src-container">
<pre class="src src-rust"> <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">Our Map struct</span>
<span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">Map</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">Fn</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ECBC9C;">iter</span>: <span style="color: #89C5C8;">Iter</span>,
    <span style="color: #ECBC9C;">f</span>: <span style="color: #89C5C8;">Fn</span>,
<span style="color: #DCDCCC;">}</span>

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">We'll want to instantiate one later, so add a constructor method:</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">Fn</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">Map</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">Fn</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">new</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">iter</span>: <span style="color: #89C5C8;">Iter</span>, <span style="color: #ECBC9C;">f</span>: <span style="color: #89C5C8;">Fn</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Self</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Self</span> <span style="color: #DDCC9C;">{</span> iter, f <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>


<p>
Great, we can now tackle implementing Iterator. The first challenge is getting the types setup
for our impl. As described above, we'll need an <code>Iter</code>, <code>F</code> (map fn), and <code>Out</code> types:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">F</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">Iterator</span> ...
</pre>
</div>

<p>
But we need further guarantees as described above:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #ECBC9C;">Iter</span>: <span style="color: #89C5C8;">Iterator</span>, <span style="color: #ECBC9C;">F</span>: <span style="color: #89C5C8;">FnMut</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Iter</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Out</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">Iterator</span> ...
</pre>
</div>

<p>
I recommend the reader really make sure the type signature above makes sense. Rust has a tendency to hit type soup,
and it is worthwhile to take a minute to understand it.
</p>

<p>
We can now implement <code>Iterator</code> in a straightforward way:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #ECBC9C;">Iter</span>: <span style="color: #89C5C8;">Iterator</span>, <span style="color: #ECBC9C;">F</span>: <span style="color: #89C5C8;">FnMut</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Iter</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Out</span>, <span style="color: #89C5C8;">Out</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">Iterator</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">Map</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">F</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span> = <span style="color: #89C5C8;">Out</span>;

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">next</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">self</span>.iter.next<span style="color: #DDCC9C;">()</span>.map<span style="color: #DDCC9C;">(</span>|e| <span style="color: #A0EDF0;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>.f<span style="color: #A0EDF0;">)(</span>e<span style="color: #A0EDF0;">)</span><span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
So we're calling <code>next()</code> on our stored iterator to iterate once, and mapping the value with our stored function,
and returning it. This is very efficient and something that rustc / llvm love to optimize, which gives some insight
into why Rust iterators are so fast.
</p>

<p>
Now that we have it, let's use it!
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">nat</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>.take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">5</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">seq</span> = <span style="color: #89C5C8;">Map</span>::new<span style="color: #CCF8CC;">(</span>nat, |e| e * e<span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">i</span> <span style="color: #FDECBC; font-weight: bold;">in</span> seq <span style="color: #CCF8CC;">{</span>
        <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #DDCC9C;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, i<span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And run it:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ cargo run
     Compiling iterator-article v0.1.0 <span style="color: #DCDCCC;">(</span>/home/david/programming/iterator-article<span style="color: #DCDCCC;">)</span>
      Finished dev <span style="color: #DCDCCC;">[</span>unoptimized + debuginfo<span style="color: #DCDCCC;">]</span> target<span style="color: #DCDCCC;">(</span>s<span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">in</span> <span style="color: #CCF8CC;">0.17s</span>
       Running <span style="color: #D9A0A0;">`target/debug/iterator-article`</span>
  <span style="color: #CCF8CC;">0</span>
  <span style="color: #CCF8CC;">1</span>
  <span style="color: #CCF8CC;">4</span>
  <span style="color: #CCF8CC;">9</span>
  <span style="color: #CCF8CC;">16</span>
</pre>
</div>

<p>
Nice! We can transform sequences using our own struct. If you want to see it in action yourself, you can play with it on the <a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=b28ba9529299e04dd3f0c67b053505eb">rust playground</a>.
</p>

<p>
This is certainly powerful, but it would be nice to filter the element as well. <code>Map</code> only has access to a single element at a time, and must
operate on the element. We can play around with the function types passed but most of the time we just want to filter out certain elements.
</p>
</div>
</div>
