blog/2020-04-27/Rust-Traits-Iterator.org
*** Filter
   
=Filter= is an interesting abstraction, as it concerns itself with retaining elements of a sequence which satisfy some criteria, and dropping the rest. The criteria function,
or /predicate/ function, borrows a value from the iterator and returns true or false. If the predicate evaluates to =true= on an element, return it to the caller.
If the predicate is =false=, forget about it and continue searching.

This abstraction is also very common in other languages, and is just as essential as =Map= for functional programming.

The other wrinkle is that we need to care about ownership in Rust. =Map= would want to own each element as it needs to transform it,
but filter just needs to borrow the element. We won't cover the magic involved with the =Fn= family and references, but this will work:

#+begin_src rust
FnMut(&Iter::Item) -> bool
#+end_src

Our job is then similar to =Map=, we need a struct and constructor:

#+begin_src rust
  // struct to hold iterator and predicate function pointer
  struct Filter<Iter, Predicate> {
      iter: Iter,
      pred: Predicate,
  }

  // And a default constructor
  impl<Iter, Predicate> Filter<Iter, Predicate> {
      fn new(iter: Iter, pred: Predicate) -> Self {
          Self { iter, pred }
      }
  }
#+end_src

Same idea as =Map= -- store the iterator and function in a struct. Now we can implement =Iterator= in a similar fashion:

#+begin_src rust
impl<Iter, Predicate> Iterator for Filter<Iter, Predicate>
where
    Iter: Iterator,
    Predicate: FnMut(&Iter::Item) -> bool,
{
    type Item = Iter::Item;
    fn next(&mut self) -> Option<Self::Item> {
        while let Some(ele) = self.iter.next() {
            if (self.pred)(&ele) {
                return Some(ele);
            }
        }
        None
    }
}
#+end_src

We're again iterating over our underlying iterator, and then testing each element with our predicate.
If it passes, we return the element. We're implicitly mutating =self.iter= as it's also an iterator, so
no state is lost. When the caller calls =next()= we'll simply continue iterating where
left off in =self.iter= and continue the process. Eventually we'll exhaust the underlying iterator and stop iteration by returning =None=.

So now that we have it, let's use it! We'll build off of the =Map= example above to retain the even elements:

#+begin_src rust
fn main() {
    let nat = NaturalNumbers::new().take(10);
    let seq = Map::new(nat, |e| e * e);
    let mut seq = Filter::new(seq, |e: &u32| *e % 2 == 0);
    for i in seq {
        println!("{}", i);
    }
}
#+end_src

Which when run prints out ([[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=44af002b33a4d95f3c79187ef4588e37][run it on the playground here]]):

#+begin_example
~ cargo run
    Finished dev [unoptimized + debuginfo] target(s) in 0.04s
     Running `target/debug/iterator-article`
0
4
16
36
64
#+end_example

Great! We can now selectively retain elements in a sequence. The final tool to make is =reduce= (also called =fold=) which is the most powerful tool yet.

