blog/2020-04-27/Rust-Traits-Iterator.html

<div id="outline-container-orgbf58474" class="outline-4">
<h4 id="orgbf58474">Filter</h4>
<div class="outline-text-4" id="text-orgbf58474">
<p>
<code>Filter</code> is an interesting abstraction, as it concerns itself with retaining elements of a sequence which satisfy some criteria, and dropping the rest. The criteria function,
or <i>predicate</i> function, borrows a value from the iterator and returns true or false. If the predicate evaluates to <code>true</code> on an element, return it to the caller.
If the predicate is <code>false</code>, forget about it and continue searching.
</p>

<p>
This abstraction is also very common in other languages, and is just as essential as <code>Map</code> for functional programming.
</p>

<p>
The other wrinkle is that we need to care about ownership in Rust. <code>Map</code> would want to own each element as it needs to transform it,
but filter just needs to borrow the element. We won't cover the magic involved with the <code>Fn</code> family and references, but this will work:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #89C5C8;">FnMut</span><span style="color: #DCDCCC;">(</span>&amp;<span style="color: #89C5C8;">Iter</span>::<span style="color: #89C5C8;">Item</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">bool</span>
</pre>
</div>

<p>
Our job is then similar to <code>Map</code>, we need a struct and constructor:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">struct to hold iterator and predicate function pointer</span>
<span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">Filter</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">Predicate</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ECBC9C;">iter</span>: <span style="color: #89C5C8;">Iter</span>,
    <span style="color: #ECBC9C;">pred</span>: <span style="color: #89C5C8;">Predicate</span>,
<span style="color: #DCDCCC;">}</span>

<span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">And a default constructor</span>
<span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">Predicate</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">Filter</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">Predicate</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">new</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">iter</span>: <span style="color: #89C5C8;">Iter</span>, <span style="color: #ECBC9C;">pred</span>: <span style="color: #89C5C8;">Predicate</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Self</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Self</span> <span style="color: #DDCC9C;">{</span> iter, pred <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Same idea as <code>Map</code> &#x2013; store the iterator and function in a struct. Now we can implement <code>Iterator</code> in a similar fashion:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">Predicate</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">Iterator</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">Filter</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">Predicate</span><span style="color: #DCDCCC;">&gt;</span>
<span style="color: #FDECBC; font-weight: bold;">where</span>
    <span style="color: #ECBC9C;">Iter</span>: <span style="color: #89C5C8;">Iterator</span>,
    <span style="color: #ECBC9C;">Predicate</span>: <span style="color: #89C5C8;">FnMut</span><span style="color: #DCDCCC;">(</span>&amp;<span style="color: #89C5C8;">Iter</span>::<span style="color: #89C5C8;">Item</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">bool</span>,
<span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span> = <span style="color: #89C5C8;">Iter</span>::<span style="color: #89C5C8;">Item</span>;
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">next</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">while</span> <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span>ele<span style="color: #DDCC9C;">)</span> = <span style="color: #FDECBC; font-weight: bold;">self</span>.iter.next<span style="color: #DDCC9C;">()</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #FDECBC; font-weight: bold;">if</span> <span style="color: #A0EDF0;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>.pred<span style="color: #A0EDF0;">)(</span>&amp;ele<span style="color: #A0EDF0;">)</span> <span style="color: #A0EDF0;">{</span>
                <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Some</span><span style="color: #ACD2AC;">(</span>ele<span style="color: #ACD2AC;">)</span>;
            <span style="color: #A0EDF0;">}</span>
        <span style="color: #DDCC9C;">}</span>
        <span style="color: #89C5C8;">None</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We're again iterating over our underlying iterator, and then testing each element with our predicate.
If it passes, we return the element. We're implicitly mutating <code>self.iter</code> as it's also an iterator, so
no state is lost. When the caller calls <code>next()</code> we'll simply continue iterating where
left off in <code>self.iter</code> and continue the process. Eventually we'll exhaust the underlying iterator and stop iteration by returning <code>None</code>.
</p>

<p>
So now that we have it, let's use it! We'll build off of the <code>Map</code> example above to retain the even elements:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">nat</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>.take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">10</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">seq</span> = <span style="color: #89C5C8;">Map</span>::new<span style="color: #CCF8CC;">(</span>nat, |e| e * e<span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">seq</span> = <span style="color: #89C5C8;">Filter</span>::new<span style="color: #CCF8CC;">(</span>seq, |<span style="color: #ECBC9C;">e</span>: &amp;<span style="color: #89C5C8;">u32</span>| *e % <span style="color: #CCF8CC;">2</span> == <span style="color: #CCF8CC;">0</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">i</span> <span style="color: #FDECBC; font-weight: bold;">in</span> seq <span style="color: #CCF8CC;">{</span>
        <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #DDCC9C;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, i<span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Which when run prints out (<a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=44af002b33a4d95f3c79187ef4588e37">run it on the playground here</a>):
</p>

<pre class="example">
~ cargo run
    Finished dev [unoptimized + debuginfo] target(s) in 0.04s
     Running `target/debug/iterator-article`
0
4
16
36
64
</pre>

<p>
Great! We can now selectively retain elements in a sequence. The final tool to make is <code>reduce</code> (also called <code>fold</code>) which is the most powerful tool yet.
</p>
</div>
</div>
