blog/2020-04-27/Rust-Traits-Iterator.org
*** Reduce
   
The motivation for =reduce= (=fold= in Rust) is pretty simple: We need a way to collapse entire sequences into some type. =Map= and =Filter= only operate on
each element one a time, not an entire sequence. How would we sum all numbers in a list?

The mechanics are pretty simple thankfully:

1. We have a base type; the accumulator. In the summing example, this would be 0.
2. We have a function =FnMut(acc, ele) -> acc= which melds the accumulator and the given element.

For example, to multiply a list of integers we will need:

1. The accumulator, with initial value =1=.
2. the function =|acc, ele| acc * ele=
3. A list =[1, 2, 3]=

We can view the computation with the table below:

#+CAPTION: Final result: 6
#+ATTR_HTML: :border 2 :rules all :frame border :width 50%
|------+-----+-----+---------|
| iter | acc | ele | product |
|------+-----+-----+---------|
|    1 |   1 |   1 |       1 |
|    2 |   1 |   2 |       2 |
|    3 |   2 |   3 |       6 |
|------+-----+-----+---------|

So the idea is to accumulate values into the accumulator. We don't need the =Iterator= trait just yet, so we can implement =reduce= with a free standing function:

#+begin_src rust
fn reduce<Acc, Iter, ReduceFn>(iterator: Iter, acc: Acc, reducefn: ReduceFn) -> Acc
where
    Iter: Iterator,
    ReduceFn: Fn(Acc, Iter::Item) -> Acc,
{
    let mut acc = acc;
    for ele in iterator {
        acc = reducefn(acc, ele);
    }
    acc
}
#+end_src

We can now use it:

#+begin_src rust
fn main() {
    let nat = NaturalNumbers::new().take(4);
    let mut seq = Filter::new(nat, |e: &u32| *e > 0);
    let prod = reduce(seq, 1, |acc, ele| acc * ele);
    println!("{}", prod);
}
#+end_src

Which outputs =1 * 1 * 2 * 3 = 6= as expected ([[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=5630f5d4ef8e40f05a6dba0f50a4fc15][rust playground]]):

#+begin_example
~ cargo run
    Blocking waiting for file lock on build directory
   Compiling iterator-article v0.1.0 (/home/david/programming/iterator-article)
    Finished dev [unoptimized + debuginfo] target(s) in 0.33s
     Running `target/debug/iterator-article`
6
#+end_example

*** Quick note on reduce

=reduce= is strictly more powerful than =Map= and =Filter= as it has access to the whole
collection _and_ an accumulator. We can easily implement =Filter= in terms of reduce
for example:

#+begin_src rust
let mut empty_vec = vec![];
let bigger_than_five = reduce(
    NaturalNumbers::new().take(10),
    &mut empty_vec,
    |acc, ele| {
        if ele > 5 {
            acc.push(ele);
        }
        acc
    },
);
#+end_src

I would recommend playing around with this function. It's useful to internalize that
reduce (fold) can produce /any/ output type. However I would keep in mind that unnecessary uses of reduce like the
example above removes access to the =Iterator= performance optimizations.

