blog/2020-04-27/Rust-Traits-Iterator.html

<div id="outline-container-orgbc03213" class="outline-4">
<h4 id="orgbc03213">Reduce</h4>
<div class="outline-text-4" id="text-orgbc03213">
<p>
The motivation for <code>reduce</code> (<code>fold</code> in Rust) is pretty simple: We need a way to collapse entire sequences into some type. <code>Map</code> and <code>Filter</code> only operate on
each element one a time, not an entire sequence. How would we sum all numbers in a list?
</p>

<p>
The mechanics are pretty simple thankfully:
</p>

<ol class="org-ol">
<li>We have a base type; the accumulator. In the summing example, this would be 0.</li>
<li>We have a function <code>FnMut(acc, ele) -&gt; acc</code> which melds the accumulator and the given element.</li>
</ol>

<p>
For example, to multiply a list of integers we will need:
</p>

<ol class="org-ol">
<li>The accumulator, with initial value <code>1</code>.</li>
<li>the function <code>|acc, ele| acc * ele</code></li>
<li>A list <code>[1, 2, 3]</code></li>
</ol>

<p>
We can view the computation with the table below:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border" width="50%">
<caption class="t-above"><span class="table-number">Table 1:</span> Final result: 6</caption>

<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">iter</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">ele</th>
<th scope="col" class="org-right">product</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">6</td>
</tr>
</tbody>
</table>

<p>
So the idea is to accumulate values into the accumulator. We don't need the <code>Iterator</code> trait just yet, so we can implement <code>reduce</code> with a free standing function:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">reduce</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Acc</span>, <span style="color: #89C5C8;">Iter</span>, <span style="color: #89C5C8;">ReduceFn</span><span style="color: #DCDCCC;">&gt;(</span><span style="color: #ECBC9C;">iterator</span>: <span style="color: #89C5C8;">Iter</span>, <span style="color: #ECBC9C;">acc</span>: <span style="color: #89C5C8;">Acc</span>, <span style="color: #ECBC9C;">reducefn</span>: <span style="color: #89C5C8;">ReduceFn</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Acc</span>
<span style="color: #FDECBC; font-weight: bold;">where</span>
    <span style="color: #ECBC9C;">Iter</span>: <span style="color: #89C5C8;">Iterator</span>,
    <span style="color: #ECBC9C;">ReduceFn</span>: <span style="color: #89C5C8;">Fn</span><span style="color: #DCDCCC;">(</span><span style="color: #89C5C8;">Acc</span>, <span style="color: #89C5C8;">Iter</span>::<span style="color: #89C5C8;">Item</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Acc</span>,
<span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">acc</span> = acc;
    <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">ele</span> <span style="color: #FDECBC; font-weight: bold;">in</span> iterator <span style="color: #CCF8CC;">{</span>
        acc = reducefn<span style="color: #DDCC9C;">(</span>acc, ele<span style="color: #DDCC9C;">)</span>;
    <span style="color: #CCF8CC;">}</span>
    acc
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
We can now use it:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">nat</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>.take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">4</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">seq</span> = <span style="color: #89C5C8;">Filter</span>::new<span style="color: #CCF8CC;">(</span>nat, |<span style="color: #ECBC9C;">e</span>: &amp;<span style="color: #89C5C8;">u32</span>| *e &gt; <span style="color: #CCF8CC;">0</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">prod</span> = reduce<span style="color: #CCF8CC;">(</span>seq, <span style="color: #CCF8CC;">1</span>, |acc, ele| acc * ele<span style="color: #CCF8CC;">)</span>;
    <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, prod<span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Which outputs <code>1 * 1 * 2 * 3 = 6</code> as expected (<a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=5630f5d4ef8e40f05a6dba0f50a4fc15">rust playground</a>):
</p>

<pre class="example">
~ cargo run
    Blocking waiting for file lock on build directory
   Compiling iterator-article v0.1.0 (/home/david/programming/iterator-article)
    Finished dev [unoptimized + debuginfo] target(s) in 0.33s
     Running `target/debug/iterator-article`
6
</pre>
</div>
</div>

<div id="outline-container-orgb222ccc" class="outline-4">
<h4 id="orgb222ccc">Quick note on reduce</h4>
<div class="outline-text-4" id="text-orgb222ccc">
<p>
<code>reduce</code> is strictly more powerful than <code>Map</code> and <code>Filter</code> as it has access to the whole
collection <span class="underline">and</span> an accumulator. We can easily implement <code>Filter</code> in terms of reduce
for example:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">empty_vec</span> = <span style="color: #9CC7FB;">vec!</span><span style="color: #DCDCCC;">[]</span>;
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">bigger_than_five</span> = reduce<span style="color: #DCDCCC;">(</span>
    <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>.take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">10</span><span style="color: #CCF8CC;">)</span>,
    &amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> empty_vec,
    |acc, ele| <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">if</span> ele &gt; <span style="color: #CCF8CC;">5</span> <span style="color: #DDCC9C;">{</span>
            acc.push<span style="color: #A0EDF0;">(</span>ele<span style="color: #A0EDF0;">)</span>;
        <span style="color: #DDCC9C;">}</span>
        acc
    <span style="color: #CCF8CC;">}</span>,
<span style="color: #DCDCCC;">)</span>;
</pre>
</div>

<p>
I would recommend playing around with this function. It's useful to internalize that
reduce (fold) can produce <i>any</i> output type. However I would keep in mind that unnecessary uses of reduce like the
example above removes access to the <code>Iterator</code> performance optimizations.
</p>
</div>
</div>
</div>
