blog/2020-04-27/Rust-Traits-Iterator.org
** Part 2: Our own Iterator Trait
   
The following code is certainly nice:

#+begin_src rust
let nat = NaturalNumbers::new().take(4);
let doubled = Map::new(nat, |e| e * e);
let mut seq = Filter::new(doubled, |e: &u32| *e % 2 == 0);
let prod = reduce(seq, 1, |acc, ele| acc * ele);
#+end_src

But this is far easier to read:

#+begin_src rust
let prod = NaturalNumbers::new()
    .take(4)
    .map(|e| e * e)
    .filter(|e: &u32| *e % 2 == 0)
    .reduce(1, |acc, ele| acc * ele);
#+end_src

The question is then: How does =Iterator= provide this interface?

As mentioned above, =Iterator= provides a whole bunch of default methods to facilitate this clean API.
To better understand how this works, let's define our own =Iterator= trait:

#+begin_src rust
trait MyIterator {
    type Item;
    fn next(&mut self) -> Option<Self::Item>;
}
#+end_src

And update our previous =Iterator= implementations:

#+begin_src diff
  -impl<Iter, Predicate> Iterator for Filter<Iter, Predicate>
  +impl<Iter, Predicate> MyIterator for Filter<Iter, Predicate>
  ...
#+end_src

You can view the whole refactor on the [[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=7105450011805c24c368ba521d7dfdf6][rust playground]]. Unfortunately,
our changes don't compile as we no longer have a =Iterator::take(N)= method:

#+begin_src rust
error[E0599]: no method named `take` found for struct `NaturalNumbers` in the current scope
   --> src/main.rs:116:37
    |
1   | struct NaturalNumbers {
    | ---------------------
    | |
    | method `take` not found for this
    | doesn't satisfy `NaturalNumbers: std::iter::Iterator`
...
116 |     let nat = NaturalNumbers::new().take(4);
    |                                     ^^^^ method not found in `NaturalNumbers`
    |
    = note: the method `take` exists but the following trait bounds were not satisfied:
            `NaturalNumbers: std::iter::Iterator`
            which is required by `&mut NaturalNumbers: std::iter::Iterator`
    = help: items from traits can only be used if the trait is implemented and in scope
    = note: the following trait defines an item `take`, perhaps you need to implement it:
            candidate #1: `std::iter::Iterator`
#+end_src

It's looking like we'll need to implement =Take= ourselves. It's a very similar process
as before. We'll need a struct and =Iterator= implementation:

#+begin_src rust
struct Take<Iter> {
    iterator: Iter,
    left: usize,
}

impl<Iter> Take<Iter> {
    fn new(iterator: Iter, left: usize) -> Self {
        Self { iterator, left }
    }
}

impl<Iter: MyIterator> MyIterator for Take<Iter> {
    type Item = Iter::Item;
    fn next(&mut self) -> Option<Self::Item> {
        if self.left > 0 {
            self.left -= 1;
            self.iterator.next()
        } else {
            None
        }
    }
}
#+end_src

Now that we have the struct, we need to modify =MyIterator= to achieve the desired API.
Things will get a bit introspective, as we cannot refer to any concrete types. We instead
rely on the =Self= language feature to specify that types which implement =MyIterator=
will be the ones used in the method calls. We'll want to transfer ownership of iterators
in these methods, so our =MyIterator::Take(N)= signature will read:

#+begin_src rust
fn take(self, left: usize) -> Take<Self>
#+end_src

The other wrinkle is that this won't compile, as the Rust compiler is not confident
it can layout the =Take= struct properly, as =Self= can be =!Sized=. This can seem
obscure, but the error message is pretty good:

#+begin_src rust
error[E0277]: the size for values of type `Self` cannot be known at compilation time
   --> src/main.rs:116:37
    |
90  | struct Take<Iter> {
    |             ---- required by this bound in `Take`
...
116 |     fn take(self, amount: usize) -> Take<Self> {
    |                                     ^^^^^^^^^^- help: consider further restricting `Self`: `where Self: std::marker::Sized`
    |                                     |
    |                                     doesn't have a size known at compile-time
    |
    = help: the trait `std::marker::Sized` is not implemented for `Self`
    = note: to learn more, visit <https://doc.rust-lang.org/book/ch19-04-advanced-types.html#dynamically-sized-types-and-the-sized-trait>
#+end_src

To better understand this error, what is the type of =seq= in the following?

#+begin_src rust
let seq = NaturalNumbers::new()
    .take(4)
    .map(|e| e * e)
    .filter(|e: &u32| *e % 2 == 0);
#+end_src

The answer is =Filter<Map<Take<NaturalNumbers>, fn#1>, fn#2>=.

Recall that =Map=, =Filter=, and =Take= all take a type =Iter: MyIterator= by value,
so it needs to physically store that iterator in the struct memory layout. The Rust
language tracks this information in the =Sized=  trait. So if a type is =Sized=, Rust
can properly lay out the struct. If a type is =!Sized=, then indirection or obscure
language features are required to embed that type in the struct.
The compiler has helpfully told us to add a =Sized= bound on =Self=:

#+begin_src diff
 fn take(self, amount: usize) -> Take<Self>
+where
+    Self: std::marker::Sized,
 {
     Take::new(self, amount)
 }
#+end_src

This [[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=09e555f21e9f3a4d5110be58931b93d1][compiles and works]]! Let's run our main again:

#+begin_src rust
fn main() {
    let nat = NaturalNumbers::new().take(4);
    let doubled = Map::new(nat, |e| e * e);
    let seq = Filter::new(doubled, |e: &u32| *e > 0);
    let prod = reduce(seq, 1, |acc, ele| acc * ele);
    println!("{}", prod);
}
#+end_src

Which outputs:

#+begin_src t
~ cargo run
    Finished dev [unoptimized + debuginfo] target(s) in 0.03s
     Running `target/debug/iterator-article`
36
#+end_src

We can now do the same procedure for =Map= and =Filter=. We can reuse
the constructors but replace =Iter= with =Self=:

#+begin_src rust
  trait MyIterator {
      // elided ...

      fn map<Out, F>(self, f: F) -> Map<Self, F>
      where
          F: FnMut(Self::Item) -> Out,
          Self: std::marker::Sized,
      {
          Map::new(self, f)
      }

      fn filter<F>(self, f: F) -> Filter<Self, F>
      where
          F: FnMut(&Self::Item) -> bool,
          Self: std::marker::Sized,
      {
          Filter::new(self, f)
      }
  }

#+end_src

Our main function is now:

#+begin_src rust
fn main() {
    let seq = NaturalNumbers::new()
        .take(4)
        .map(|e| e * e)
        .filter(|e: &u32| *e > 0);
    let prod = reduce(seq, 1, |acc, ele| acc * ele);
    println!("{}", prod);
}
#+end_src

Which outputs =36= as before. Now we just need to implement reduce in a similar way as before:

#+begin_src rust
  trait MyIterator {
    // elided...
    
    fn reduce<Acc, ReduceFn>(mut self, acc: Acc, mut reducefn: ReduceFn) -> Acc
    where
        ReduceFn: FnMut(Acc, Self::Item) -> Acc,
        Self: std::marker::Sized,
    {
        let mut acc = acc;
        while let Some(ele) = self.next() {
            acc = reducefn(acc, ele);
        }
        acc
    }
  }
#+end_src

And change our main function to be:

#+begin_src rust
fn main() {
    let prod = NaturalNumbers::new()
        .take(4)
        .map(|e| e * e)
        .filter(|e: &u32| *e > 0)
        .reduce(1, |acc, ele| acc * ele);
    println!("{}", prod);
}
#+end_src

Which outputs =36= as expected ([[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=038fda10c9decd7645ab3d85d4e12951][rust playground]]):

#+begin_src example
~ cargo run
   Compiling iterator-article v0.1.0 (/home/david/programming/iterator-article)
    Finished dev [unoptimized + debuginfo] target(s) in 0.15s
     Running `target/debug/iterator-article`
36
#+end_src

