blog/2020-04-27/Rust-Traits-Iterator.html

<div id="outline-container-org44f7662" class="outline-3">
<h3 id="org44f7662">Part 2: Our own Iterator Trait</h3>
<div class="outline-text-3" id="text-org44f7662">
<p>
The following code is certainly nice:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">nat</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #DCDCCC;">()</span>.take<span style="color: #DCDCCC;">(</span><span style="color: #CCF8CC;">4</span><span style="color: #DCDCCC;">)</span>;
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">doubled</span> = <span style="color: #89C5C8;">Map</span>::new<span style="color: #DCDCCC;">(</span>nat, |e| e * e<span style="color: #DCDCCC;">)</span>;
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">seq</span> = <span style="color: #89C5C8;">Filter</span>::new<span style="color: #DCDCCC;">(</span>doubled, |<span style="color: #ECBC9C;">e</span>: &amp;<span style="color: #89C5C8;">u32</span>| *e % <span style="color: #CCF8CC;">2</span> == <span style="color: #CCF8CC;">0</span><span style="color: #DCDCCC;">)</span>;
<span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">prod</span> = reduce<span style="color: #DCDCCC;">(</span>seq, <span style="color: #CCF8CC;">1</span>, |acc, ele| acc * ele<span style="color: #DCDCCC;">)</span>;
</pre>
</div>

<p>
But this is far easier to read:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">prod</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #DCDCCC;">()</span>
    .take<span style="color: #DCDCCC;">(</span><span style="color: #CCF8CC;">4</span><span style="color: #DCDCCC;">)</span>
    .map<span style="color: #DCDCCC;">(</span>|e| e * e<span style="color: #DCDCCC;">)</span>
    .filter<span style="color: #DCDCCC;">(</span>|<span style="color: #ECBC9C;">e</span>: &amp;<span style="color: #89C5C8;">u32</span>| *e % <span style="color: #CCF8CC;">2</span> == <span style="color: #CCF8CC;">0</span><span style="color: #DCDCCC;">)</span>
    .reduce<span style="color: #DCDCCC;">(</span><span style="color: #CCF8CC;">1</span>, |acc, ele| acc * ele<span style="color: #DCDCCC;">)</span>;
</pre>
</div>

<p>
The question is then: How does <code>Iterator</code> provide this interface?
</p>

<p>
As mentioned above, <code>Iterator</code> provides a whole bunch of default methods to facilitate this clean API.
To better understand how this works, let's define our own <code>Iterator</code> trait:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">trait</span> <span style="color: #89C5C8;">MyIterator</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span>;
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">next</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">&gt;</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And update our previous <code>Iterator</code> implementations:
</p>

<div class="org-src-container">
<pre class="src src-diff"><span style="color: #D9A0A0;">-</span><span style="color: #D9A0A0;">impl&lt;Iter,</span><span style="color: #DDCC9C;"> </span><span style="color: #D9A0A0;">Predicate&gt;</span><span style="color: #DDCC9C;"> </span><span style="color: #D9A0A0;">Iterator</span><span style="color: #DDCC9C;"> </span><span style="color: #D9A0A0;">for</span><span style="color: #DDCC9C;"> </span><span style="color: #D9A0A0;">Filter&lt;Iter,</span><span style="color: #DDCC9C;"> </span><span style="color: #D9A0A0;">Predicate&gt;</span>
<span style="color: #CCF8CC;">+</span><span style="color: #CCF8CC;">impl&lt;Iter,</span><span style="color: #DDCC9C;"> </span><span style="color: #CCF8CC;">Predicate&gt;</span><span style="color: #DDCC9C;"> </span><span style="color: #CCF8CC;">MyIterator</span><span style="color: #DDCC9C;"> </span><span style="color: #CCF8CC;">for</span><span style="color: #DDCC9C;"> </span><span style="color: #CCF8CC;">Filter&lt;Iter,</span><span style="color: #DDCC9C;"> </span><span style="color: #CCF8CC;">Predicate&gt;</span>
...
</pre>
</div>

<p>
You can view the whole refactor on the <a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=7105450011805c24c368ba521d7dfdf6">rust playground</a>. Unfortunately,
our changes don't compile as we no longer have a <code>Iterator::take(N)</code> method:
</p>

<div class="org-src-container">
<pre class="src src-rust">error<span style="color: #DCDCCC;">[</span><span style="color: #89C5C8;">E0599</span><span style="color: #DCDCCC;">]</span>: no method named `take` found <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #FDECBC; font-weight: bold;">struct</span> `<span style="color: #89C5C8;">NaturalNumbers</span>` <span style="color: #FDECBC; font-weight: bold;">in</span> the current scope
   --&gt; src/main.<span style="color: #ECBC9C;">rs</span>:<span style="color: #CCF8CC;">116</span>:<span style="color: #CCF8CC;">37</span>
    |
<span style="color: #CCF8CC;">1</span>   | <span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">NaturalNumbers</span> <span style="color: #DCDCCC;">{</span>
    | ---------------------
    | |
    | method `take` not found <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">this</span>
    | doesn'<span style="color: #ECBC9C;">t</span> satisfy `<span style="color: #ECBC9C;">NaturalNumbers</span>: <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">iter</span>::<span style="color: #89C5C8;">Iterator</span>`
...
<span style="color: #CCF8CC;">116</span> |     <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">nat</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>.take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">4</span><span style="color: #CCF8CC;">)</span>;
    |                                     ^^^^ method not found <span style="color: #FDECBC; font-weight: bold;">in</span> `<span style="color: #89C5C8;">NaturalNumbers</span>`
    |
    = <span style="color: #ECBC9C;">note</span>: the method `take` exists but the following <span style="color: #FDECBC; font-weight: bold;">trait</span> bounds were not <span style="color: #ECBC9C;">satisfied</span>:
            `<span style="color: #ECBC9C;">NaturalNumbers</span>: <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">iter</span>::<span style="color: #89C5C8;">Iterator</span>`
            which is required by `&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">NaturalNumbers</span>: <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">iter</span>::<span style="color: #89C5C8;">Iterator</span>`
    = <span style="color: #ECBC9C;">help</span>: items from traits can only be used <span style="color: #FDECBC; font-weight: bold;">if</span> the <span style="color: #FDECBC; font-weight: bold;">trait</span> is implemented and <span style="color: #FDECBC; font-weight: bold;">in</span> scope
    = <span style="color: #ECBC9C;">note</span>: the following <span style="color: #FDECBC; font-weight: bold;">trait</span> defines an item `take`, perhaps you need to implement <span style="color: #ECBC9C;">it</span>:
            candidate #<span style="color: #CCF8CC;">1</span>: `<span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">iter</span>::<span style="color: #89C5C8;">Iterator</span>`
</pre>
</div>

<p>
It's looking like we'll need to implement <code>Take</code> ourselves. It's a very similar process
as before. We'll need a struct and <code>Iterator</code> implementation:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">Take</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ECBC9C;">iterator</span>: <span style="color: #89C5C8;">Iter</span>,
    <span style="color: #ECBC9C;">left</span>: <span style="color: #89C5C8;">usize</span>,
<span style="color: #DCDCCC;">}</span>

<span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">Take</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">new</span><span style="color: #CCF8CC;">(</span><span style="color: #ECBC9C;">iterator</span>: <span style="color: #89C5C8;">Iter</span>, <span style="color: #ECBC9C;">left</span>: <span style="color: #89C5C8;">usize</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Self</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Self</span> <span style="color: #DDCC9C;">{</span> iterator, left <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #FDECBC; font-weight: bold;">impl</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #ECBC9C;">Iter</span>: <span style="color: #89C5C8;">MyIterator</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #89C5C8;">MyIterator</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">Take</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span> = <span style="color: #89C5C8;">Iter</span>::<span style="color: #89C5C8;">Item</span>;
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">next</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">if</span> <span style="color: #FDECBC; font-weight: bold;">self</span>.left &gt; <span style="color: #CCF8CC;">0</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #FDECBC; font-weight: bold;">self</span>.left -= <span style="color: #CCF8CC;">1</span>;
            <span style="color: #FDECBC; font-weight: bold;">self</span>.iterator.next<span style="color: #A0EDF0;">()</span>
        <span style="color: #DDCC9C;">}</span> <span style="color: #FDECBC; font-weight: bold;">else</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #89C5C8;">None</span>
        <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Now that we have the struct, we need to modify <code>MyIterator</code> to achieve the desired API.
Things will get a bit introspective, as we cannot refer to any concrete types. We instead
rely on the <code>Self</code> language feature to specify that types which implement <code>MyIterator</code>
will be the ones used in the method calls. We'll want to transfer ownership of iterators
in these methods, so our <code>MyIterator::Take(N)</code> signature will read:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">take</span><span style="color: #DCDCCC;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">left</span>: <span style="color: #89C5C8;">usize</span><span style="color: #DCDCCC;">)</span> -&gt; <span style="color: #89C5C8;">Take</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Self</span><span style="color: #DCDCCC;">&gt;</span>
</pre>
</div>

<p>
The other wrinkle is that this won't compile, as the Rust compiler is not confident
it can layout the <code>Take</code> struct properly, as <code>Self</code> can be <code>!Sized</code>. This can seem
obscure, but the error message is pretty good:
</p>

<div class="org-src-container">
<pre class="src src-rust">error<span style="color: #DCDCCC;">[</span><span style="color: #89C5C8;">E0277</span><span style="color: #DCDCCC;">]</span>: the size <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">values</span> of <span style="color: #FDECBC; font-weight: bold;">type</span> `<span style="color: #89C5C8;">Self</span>` cannot be known at compilation time
   --&gt; src/main.<span style="color: #ECBC9C;">rs</span>:<span style="color: #CCF8CC;">116</span>:<span style="color: #CCF8CC;">37</span>
    |
<span style="color: #CCF8CC;">90</span>  | <span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">Take</span><span style="color: #DCDCCC;">&lt;</span><span style="color: #89C5C8;">Iter</span><span style="color: #DCDCCC;">&gt;</span> <span style="color: #DCDCCC;">{</span>
    |             ---- required by this bound <span style="color: #FDECBC; font-weight: bold;">in</span> `<span style="color: #89C5C8;">Take</span>`
...
<span style="color: #CCF8CC;">116</span> |     <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">take</span><span style="color: #CCF8CC;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">amount</span>: <span style="color: #89C5C8;">usize</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Take</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
    |                                     ^^^^^^^^^^- <span style="color: #ECBC9C;">help</span>: consider further restricting `<span style="color: #89C5C8;">Self</span>`: `<span style="color: #FDECBC; font-weight: bold;">where</span> <span style="color: #ECBC9C;">Self</span>: <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">marker</span>::<span style="color: #89C5C8;">Sized</span>`
    |                                     |
    |                                     doesn'<span style="color: #ECBC9C;">t</span> have a size known at compile-time
    |
    = <span style="color: #ECBC9C;">help</span>: the <span style="color: #FDECBC; font-weight: bold;">trait</span> `<span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">marker</span>::<span style="color: #89C5C8;">Sized</span>` is not implemented <span style="color: #FDECBC; font-weight: bold;">for</span> `<span style="color: #89C5C8;">Self</span>`
    = <span style="color: #ECBC9C;">note</span>: to learn more, visit <a href="https://doc.rust-lang.org/book/ch19-04-advanced-types.html#dynamically-sized-types-and-the-sized-trait">&lt;</a><span style="color: #ECBC9C;"><a href="https://doc.rust-lang.org/book/ch19-04-advanced-types.html#dynamically-sized-types-and-the-sized-trait">https</a></span><a href="https://doc.rust-lang.org/book/ch19-04-advanced-types.html#dynamically-sized-types-and-the-sized-trait">:</a><span style="color: #6C8C6C;"><a href="https://doc.rust-lang.org/book/ch19-04-advanced-types.html#dynamically-sized-types-and-the-sized-trait">//</a></span><span style="color: #8CAC8C;"><a href="https://doc.rust-lang.org/book/ch19-04-advanced-types.html#dynamically-sized-types-and-the-sized-trait">doc.rust-lang.org/book/ch19-04-advanced-types.html#dynamically-sized-types-and-the-sized-trait&gt;</a></span>
</pre>
</div>

<p>
To better understand this error, what is the type of <code>seq</code> in the following?
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">seq</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #DCDCCC;">()</span>
    .take<span style="color: #DCDCCC;">(</span><span style="color: #CCF8CC;">4</span><span style="color: #DCDCCC;">)</span>
    .map<span style="color: #DCDCCC;">(</span>|e| e * e<span style="color: #DCDCCC;">)</span>
    .filter<span style="color: #DCDCCC;">(</span>|<span style="color: #ECBC9C;">e</span>: &amp;<span style="color: #89C5C8;">u32</span>| *e % <span style="color: #CCF8CC;">2</span> == <span style="color: #CCF8CC;">0</span><span style="color: #DCDCCC;">)</span>;
</pre>
</div>

<p>
The answer is <code>Filter&lt;Map&lt;Take&lt;NaturalNumbers&gt;, fn#1&gt;, fn#2&gt;</code>.
</p>

<p>
Recall that <code>Map</code>, <code>Filter</code>, and <code>Take</code> all take a type <code>Iter: MyIterator</code> by value,
so it needs to physically store that iterator in the struct memory layout. The Rust
language tracks this information in the <code>Sized</code>  trait. So if a type is <code>Sized</code>, Rust
can properly lay out the struct. If a type is <code>!Sized</code>, then indirection or obscure
language features are required to embed that type in the struct.
The compiler has helpfully told us to add a <code>Sized</code> bound on <code>Self</code>:
</p>

<div class="org-src-container">
<pre class="src src-diff"><span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">fn</span><span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">take(self,</span><span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">amount:</span><span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">usize)</span><span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">-&gt;</span><span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">Take&lt;Self&gt;</span>
<span style="color: #CCF8CC;">+</span><span style="color: #CCF8CC;">where</span>
<span style="color: #CCF8CC;">+</span><span style="color: #DDCC9C;">    </span><span style="color: #CCF8CC;">Self:</span><span style="color: #DDCC9C;"> </span><span style="color: #CCF8CC;">std::marker::Sized,</span>
<span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">{</span>
<span style="color: #D9A0A0;">    </span><span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">Take::new(self,</span><span style="color: #DDCC9C;"> </span><span style="color: #dddddd;">amount)</span>
<span style="color: #DDCC9C;"> </span>}
</pre>
</div>

<p>
This <a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=09e555f21e9f3a4d5110be58931b93d1">compiles and works</a>! Let's run our main again:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">nat</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>.take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">4</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">doubled</span> = <span style="color: #89C5C8;">Map</span>::new<span style="color: #CCF8CC;">(</span>nat, |e| e * e<span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">seq</span> = <span style="color: #89C5C8;">Filter</span>::new<span style="color: #CCF8CC;">(</span>doubled, |<span style="color: #ECBC9C;">e</span>: &amp;<span style="color: #89C5C8;">u32</span>| *e &gt; <span style="color: #CCF8CC;">0</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">prod</span> = reduce<span style="color: #CCF8CC;">(</span>seq, <span style="color: #CCF8CC;">1</span>, |acc, ele| acc * ele<span style="color: #CCF8CC;">)</span>;
    <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, prod<span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Which outputs:
</p>

<div class="org-src-container">
<pre class="src src-t">~ cargo run
    Finished dev [unoptimized + debuginfo] target(s) in 0.03s
     Running `target/debug/iterator-article`
36
</pre>
</div>

<p>
We can now do the same procedure for <code>Map</code> and <code>Filter</code>. We can reuse
the constructors but replace <code>Iter</code> with <code>Self</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">trait</span> <span style="color: #89C5C8;">MyIterator</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">elided ...</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">map</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Out</span>, <span style="color: #89C5C8;">F</span><span style="color: #CCF8CC;">&gt;(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">f</span>: <span style="color: #89C5C8;">F</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Map</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>, <span style="color: #89C5C8;">F</span><span style="color: #CCF8CC;">&gt;</span>
    <span style="color: #FDECBC; font-weight: bold;">where</span>
        <span style="color: #ECBC9C;">F</span>: <span style="color: #89C5C8;">FnMut</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Out</span>,
        <span style="color: #ECBC9C;">Self</span>: <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">marker</span>::<span style="color: #89C5C8;">Sized</span>,
    <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Map</span>::new<span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, f<span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">filter</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">F</span><span style="color: #CCF8CC;">&gt;(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">f</span>: <span style="color: #89C5C8;">F</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Filter</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Self</span>, <span style="color: #89C5C8;">F</span><span style="color: #CCF8CC;">&gt;</span>
    <span style="color: #FDECBC; font-weight: bold;">where</span>
        <span style="color: #ECBC9C;">F</span>: <span style="color: #89C5C8;">FnMut</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">bool</span>,
        <span style="color: #ECBC9C;">Self</span>: <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">marker</span>::<span style="color: #89C5C8;">Sized</span>,
    <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Filter</span>::new<span style="color: #DDCC9C;">(</span><span style="color: #FDECBC; font-weight: bold;">self</span>, f<span style="color: #DDCC9C;">)</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>

</pre>
</div>

<p>
Our main function is now:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">seq</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>
        .take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">4</span><span style="color: #CCF8CC;">)</span>
        .map<span style="color: #CCF8CC;">(</span>|e| e * e<span style="color: #CCF8CC;">)</span>
        .filter<span style="color: #CCF8CC;">(</span>|<span style="color: #ECBC9C;">e</span>: &amp;<span style="color: #89C5C8;">u32</span>| *e &gt; <span style="color: #CCF8CC;">0</span><span style="color: #CCF8CC;">)</span>;
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">prod</span> = reduce<span style="color: #CCF8CC;">(</span>seq, <span style="color: #CCF8CC;">1</span>, |acc, ele| acc * ele<span style="color: #CCF8CC;">)</span>;
    <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, prod<span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Which outputs <code>36</code> as before. Now we just need to implement reduce in a similar way as before:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">trait</span> <span style="color: #89C5C8;">MyIterator</span> <span style="color: #DCDCCC;">{</span>
  <span style="color: #6C8C6C;">// </span><span style="color: #8CAC8C;">elided...</span>

  <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">reduce</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">Acc</span>, <span style="color: #89C5C8;">ReduceFn</span><span style="color: #CCF8CC;">&gt;(</span><span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span>, <span style="color: #ECBC9C;">acc</span>: <span style="color: #89C5C8;">Acc</span>, <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">reducefn</span>: <span style="color: #89C5C8;">ReduceFn</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Acc</span>
  <span style="color: #FDECBC; font-weight: bold;">where</span>
      <span style="color: #ECBC9C;">ReduceFn</span>: <span style="color: #89C5C8;">FnMut</span><span style="color: #CCF8CC;">(</span><span style="color: #89C5C8;">Acc</span>, <span style="color: #89C5C8;">Self</span>::<span style="color: #89C5C8;">Item</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Acc</span>,
      <span style="color: #ECBC9C;">Self</span>: <span style="color: #CCF8CC;">std</span>::<span style="color: #CCF8CC;">marker</span>::<span style="color: #89C5C8;">Sized</span>,
  <span style="color: #CCF8CC;">{</span>
      <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #ECBC9C;">acc</span> = acc;
      <span style="color: #FDECBC; font-weight: bold;">while</span> <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #89C5C8;">Some</span><span style="color: #DDCC9C;">(</span>ele<span style="color: #DDCC9C;">)</span> = <span style="color: #FDECBC; font-weight: bold;">self</span>.next<span style="color: #DDCC9C;">()</span> <span style="color: #DDCC9C;">{</span>
          acc = reducefn<span style="color: #A0EDF0;">(</span>acc, ele<span style="color: #A0EDF0;">)</span>;
      <span style="color: #DDCC9C;">}</span>
      acc
  <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And change our main function to be:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">let</span> <span style="color: #ECBC9C;">prod</span> = <span style="color: #89C5C8;">NaturalNumbers</span>::new<span style="color: #CCF8CC;">()</span>
        .take<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">4</span><span style="color: #CCF8CC;">)</span>
        .map<span style="color: #CCF8CC;">(</span>|e| e * e<span style="color: #CCF8CC;">)</span>
        .filter<span style="color: #CCF8CC;">(</span>|<span style="color: #ECBC9C;">e</span>: &amp;<span style="color: #89C5C8;">u32</span>| *e &gt; <span style="color: #CCF8CC;">0</span><span style="color: #CCF8CC;">)</span>
        .reduce<span style="color: #CCF8CC;">(</span><span style="color: #CCF8CC;">1</span>, |acc, ele| acc * ele<span style="color: #CCF8CC;">)</span>;
    <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{}</span><span style="color: #D9A0A0;">"</span>, prod<span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Which outputs <code>36</code> as expected (<a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=038fda10c9decd7645ab3d85d4e12951">rust playground</a>):
</p>

<div class="org-src-container">
<pre class="src src-example">~ cargo run
   Compiling iterator-article v0.1.0 (/home/david/programming/iterator-article)
    Finished dev [unoptimized + debuginfo] target(s) in 0.15s
     Running `target/debug/iterator-article`
36
</pre>
</div>
</div>
</div>
