blog/2020-04-27/Rust-Traits-Iterator.org
** Conclusion
   
Phew, 3.6k words later we've accomplished our goal. We've recreated the =Iterator=,
and delved into it's mechanics.
I hope you've learned something from his article, as I certainly learned a lot writing it.
I really like this language feature, and think it represents some of the best API design Rust offers.

** Appendix: The Primes
   
We started our journey by defining the =NaturalNumbers=, so it would be cool if we could
generate an infinite sequence of =Primes=:

#+begin_src rust
struct Primes {
    seen: Vec<u32>,
    curr: u32,
}

impl Primes {
    fn new() -> Self {
        Self {
            seen: vec![],
            curr: 2,
        }
    }
}

impl Iterator for Primes {
    type Item = u32;

    fn next(&mut self) -> Option<u32> {
        for ele in self.curr.. {
            if !self.seen.iter().any(|prime| ele % prime == 0) {
                self.seen.push(ele);
                self.curr = ele + 1;
                return Some(ele);
            }
        }
        None
    }
}
#+end_src

Which can we use:

#+begin_src rust
fn main() {
    println!("{:?}", Primes::new().take(20).collect::<Vec<_>>());
}
#+end_src

And this outputs the first twenty primes ([[https://play.rust-lang.org/?version=stable&mode=debug&edition=2018&gist=4a14a37048c8adc13bbd72822827aa12][rust playground]]):

#+begin_src rust
~ cargo run
      Finished dev [unoptimized + debuginfo] target(s) in 0.19s
       Running `target/debug/iterator-article`
  [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71]

#+end_src

It's just that easy to generate a sequence of Primes using =Iterator= in Rust.
The reader is encouraged to use =MyIterator::reduce= to achieve the same effect.
