blog/2020-04-27/Rust-Traits-Iterator.html

<div id="outline-container-org3b0c2ad" class="outline-3">
<h3 id="org3b0c2ad">Conclusion</h3>
<div class="outline-text-3" id="text-org3b0c2ad">
<p>
Phew, 3.6k words later we've accomplished our goal. We've recreated the <code>Iterator</code>,
and delved into it's mechanics.
I hope you've learned something from his article, as I certainly learned a lot writing it.
I really like this language feature, and think it represents some of the best API design Rust offers.
</p>
</div>
</div>

<div id="outline-container-org9712279" class="outline-3">
<h3 id="org9712279">Appendix: The Primes</h3>
<div class="outline-text-3" id="text-org9712279">
<p>
We started our journey by defining the <code>NaturalNumbers</code>, so it would be cool if we could
generate an infinite sequence of <code>Primes</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">struct</span> <span style="color: #89C5C8;">Primes</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #ECBC9C;">seen</span>: <span style="color: #89C5C8;">Vec</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">u32</span><span style="color: #CCF8CC;">&gt;</span>,
    <span style="color: #ECBC9C;">curr</span>: <span style="color: #89C5C8;">u32</span>,
<span style="color: #DCDCCC;">}</span>

<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Primes</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">new</span><span style="color: #CCF8CC;">()</span> -&gt; <span style="color: #89C5C8;">Self</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #89C5C8;">Self</span> <span style="color: #DDCC9C;">{</span>
            <span style="color: #ECBC9C;">seen</span>: <span style="color: #9CC7FB;">vec!</span><span style="color: #A0EDF0;">[]</span>,
            <span style="color: #ECBC9C;">curr</span>: <span style="color: #CCF8CC;">2</span>,
        <span style="color: #DDCC9C;">}</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>

<span style="color: #FDECBC; font-weight: bold;">impl</span> <span style="color: #89C5C8;">Iterator</span> <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #89C5C8;">Primes</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #FDECBC; font-weight: bold;">type</span> <span style="color: #89C5C8;">Item</span> = <span style="color: #89C5C8;">u32</span>;

    <span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">next</span><span style="color: #CCF8CC;">(</span>&amp;<span style="color: #FDECBC; font-weight: bold;">mut</span> <span style="color: #FDECBC; font-weight: bold;">self</span><span style="color: #CCF8CC;">)</span> -&gt; <span style="color: #89C5C8;">Option</span><span style="color: #CCF8CC;">&lt;</span><span style="color: #89C5C8;">u32</span><span style="color: #CCF8CC;">&gt;</span> <span style="color: #CCF8CC;">{</span>
        <span style="color: #FDECBC; font-weight: bold;">for</span> <span style="color: #ECBC9C;">ele</span> <span style="color: #FDECBC; font-weight: bold;">in</span> <span style="color: #FDECBC; font-weight: bold;">self</span>.curr.. <span style="color: #DDCC9C;">{</span>
            <span style="color: #FDECBC; font-weight: bold;">if</span> !<span style="color: #FDECBC; font-weight: bold;">self</span>.seen.iter<span style="color: #A0EDF0;">()</span>.any<span style="color: #A0EDF0;">(</span>|prime| ele % prime == <span style="color: #CCF8CC;">0</span><span style="color: #A0EDF0;">)</span> <span style="color: #A0EDF0;">{</span>
                <span style="color: #FDECBC; font-weight: bold;">self</span>.seen.push<span style="color: #ACD2AC;">(</span>ele<span style="color: #ACD2AC;">)</span>;
                <span style="color: #FDECBC; font-weight: bold;">self</span>.curr = ele + <span style="color: #CCF8CC;">1</span>;
                <span style="color: #FDECBC; font-weight: bold;">return</span> <span style="color: #89C5C8;">Some</span><span style="color: #ACD2AC;">(</span>ele<span style="color: #ACD2AC;">)</span>;
            <span style="color: #A0EDF0;">}</span>
        <span style="color: #DDCC9C;">}</span>
        <span style="color: #89C5C8;">None</span>
    <span style="color: #CCF8CC;">}</span>
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
Which can we use:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #FDECBC; font-weight: bold;">fn</span> <span style="color: #A0EDF0;">main</span><span style="color: #DCDCCC;">()</span> <span style="color: #DCDCCC;">{</span>
    <span style="color: #DCDCCC; font-weight: bold;">println!</span><span style="color: #CCF8CC;">(</span><span style="color: #D9A0A0;">"</span><span style="color: #D9A0A0; font-style: italic;">{:?}</span><span style="color: #D9A0A0;">"</span>, <span style="color: #89C5C8;">Primes</span>::new<span style="color: #DDCC9C;">()</span>.take<span style="color: #DDCC9C;">(</span><span style="color: #CCF8CC;">20</span><span style="color: #DDCC9C;">)</span>.collect::&lt;<span style="color: #89C5C8;">Vec</span>&lt;_&gt;&gt;<span style="color: #DDCC9C;">()</span><span style="color: #CCF8CC;">)</span>;
<span style="color: #DCDCCC;">}</span>
</pre>
</div>

<p>
And this outputs the first twenty primes (<a href="https://play.rust-lang.org/?version=stable&amp;mode=debug&amp;edition=2018&amp;gist=4a14a37048c8adc13bbd72822827aa12">rust playground</a>):
</p>

<div class="org-src-container">
<pre class="src src-rust">~ cargo run
      <span style="color: #89C5C8;">Finished</span> dev <span style="color: #DCDCCC;">[</span>unoptimized + debuginfo<span style="color: #DCDCCC;">]</span> target<span style="color: #DCDCCC;">(</span>s<span style="color: #DCDCCC;">)</span> <span style="color: #FDECBC; font-weight: bold;">in</span> <span style="color: #CCF8CC;">0</span>.<span style="color: #CCF8CC;">19s</span>
       <span style="color: #89C5C8;">Running</span> `target/debug/iterator-article`
  <span style="color: #DCDCCC;">[</span><span style="color: #CCF8CC;">2</span>, <span style="color: #CCF8CC;">3</span>, <span style="color: #CCF8CC;">5</span>, <span style="color: #CCF8CC;">7</span>, <span style="color: #CCF8CC;">11</span>, <span style="color: #CCF8CC;">13</span>, <span style="color: #CCF8CC;">17</span>, <span style="color: #CCF8CC;">19</span>, <span style="color: #CCF8CC;">23</span>, <span style="color: #CCF8CC;">29</span>, <span style="color: #CCF8CC;">31</span>, <span style="color: #CCF8CC;">37</span>, <span style="color: #CCF8CC;">41</span>, <span style="color: #CCF8CC;">43</span>, <span style="color: #CCF8CC;">47</span>, <span style="color: #CCF8CC;">53</span>, <span style="color: #CCF8CC;">59</span>, <span style="color: #CCF8CC;">61</span>, <span style="color: #CCF8CC;">67</span>, <span style="color: #CCF8CC;">71</span><span style="color: #DCDCCC;">]</span>

</pre>
</div>

<p>
It's just that easy to generate a sequence of Primes using <code>Iterator</code> in Rust.
The reader is encouraged to use <code>MyIterator::reduce</code> to achieve the same effect.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Briggs</p>
<p class="date">Created: 2020-05-12 Tue 14:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
